SoapRequestRepeatSale

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<RepeatSale xmlns="http://schemas.merchantwarehouse.com/merchantware/40/Credit/">
			<merchantName>abc</merchantName>
			<merchantSiteId>123</merchantSiteId>
			<merchantKey>abc123</merchantKey>
			<invoiceNumber>34</invoiceNumber>
			<token>100100100</token>
			<overrideAmount>1.15</overrideAmount>
			<expirationDate>1208</expirationDate>
			<avsStreetAddress>25</avsStreetAddress>
			<avsStreetZipCode>2</avsStreetZipCode>
			<registerNumber/>
			<merchantTransactionId/>
		</RepeatSale>
	</soap:Body>
</soap:Envelope>
